/**
 * 
 */
 var second=[ ['地质学','数学','资源科学','力学','物理学','生物学','天文学','地理学','气象学','海洋学',], 
              ['化学','材料科学','矿业工程','一般服务业','机械工业','汽车工业','铁路运输','船舶工业','动力工程','核科学技术',], 
              ['林业','园艺','农作物','农业工程','水产和渔业','畜牧与动物医学',], 
              ['医药方针法规研究','中医学','中药学','中西医结合',], 
              ['中国文学','音乐舞蹈','书法雕塑','影视戏曲艺术','中国古代史','中国近现代史','考古','哲学','心理学','宗教',], 
              ['马克思主义','中国共产党','思想政治教育','军事','宪法','国际法','民族学','学前教育','初等教育','高等教育',], 
              ['无线电电子学','计算机硬件技术','自动化技术','新闻与传媒','数字情报与数字图书馆','档案及博物馆','互联网技术',], 
              ['农业经济','经济理论及经济思想史','经济体制改革','经济统计','工业经济','交通运输经济','旅游','信息经济与邮政经济','服务于经济','金融','证券','保险','领导学和决策学',]
    ];  

    var third=[ ['岩石学','矿物学','古生物学','动力地质学','地质力学','构造地质学','宇宙地质学','环境地质学','海洋地质学','地球化学',], 
['数学概论','古典数学','数理逻辑','数学分析','初、高等数学','金融数学','代数、数论','应用数学','计算数学','运筹学',], 
['资源管理与利用','各种资源的开发与利用',], 
['力学概论','理论力学','固体力学','流体力学','爆炸力学','振动理论','流变学','应用力学',], 
['声学','光学','电磁学','热学与热分子运动论','固体物理学','半导体物理学',], 
['植物学','动物学','昆虫学','人类学','生物工程学','生理学','遗传学','细胞学',], 
['天体测量学','射电天文学','天体力学','天体物理学','太阳系','空间天文学',], 
['地貌学','土壤学','应用及分类地理学','一般理论与方法',], 
['气候学','动力气象学','应用气象学','气象灾难学','大气勘测','气象基础学科',], 
['区域海洋学','海洋气象学','海洋水文学','海洋化学','海洋物理学','海洋工程','海洋灾害','海洋生物学','海洋学','海洋资源与开发',], 
['有机化学','无机化学','高分子化学','物理化学','分析化学','应用化学','晶体学',], 
['金属材料','非金属材料','复合材料','功能材料','仿生材料','超导材料','耐高温、低温材料','耐腐蚀材料','智能材料','特种结构材料',], 
['矿山开采工程学','矿测量与勘测工程学','矿山安全与劳动保护','矿山电工','矿山运输与设备','选矿',], 
['美食学','居住管理','烹饪法','洗染、缝补',], 
['机械学','机械制造工业','起重机械与运输机械','机械工厂','气体压缩与运输机械','机械零件及其传动装置',], 
['汽车结构部件','汽车驾驶与使用','汽车保养与修理','汽车制造厂','汽车发动机','汽车理论','汽车制造工艺','汽车试验','汽车材料','汽车工业经济',], 
['铁路运输经济','电气化铁路','特种铁路','机车工程','车辆工程','铁路通信、信号','铁路运输管理工程','环境地质学','海洋地质学','地球化学',], 
['船舶原理','船舶材料','船舶机械','船舶建造工艺','船舶结构','船舶驾驶、航海学',], 
['热力工程、热机','内燃机','水能','蒸汽动力工程','动力工业经济',], 
['加速器','原子能技术经济','核反应堆工程，核电厂','辐射防护','核爆炸，放射性物质',], 
['林业基础科学','绿化建设','森林工程','森林树种','森林计测学',], 
['设施园艺','蔬菜园艺','瓜果园艺','果树园艺','观赏园艺','病虫害及其防治',], 
['禾谷类作物','豆类作物','经济作物','绿肥作物','饲料作物、牧草','野生植物及其他',], 
['农业机械及农具','农田水利及水污染防治','农业建筑','农业动力、农村能源',], 
['水产经济','渔捞','水产养殖技术','水产保护学','水产工程','水产物运输、存储保鲜',], 
['普通畜牧学','家畜','家禽','兽医学',], 
['卫生事业总论','医疗保险','医药、卫生政策法规','医疗服务、制度及改革','医疗与法','医疗器械',], 
['中国医学','中医基础理论','中医临床学','中医内科','中医外科',], 
['本草','中药材','中药药理学','中药炮制、制剂','中药化学','中药药事组织','方剂学','其他各国生药学',], 
['中西医结合基础','中西医结合临床',], 
['小说','散文','诗歌、韵文','儿童文学','戏剧文学','报告文学','少数民族文学','文学评论和研究',], 
['音乐','舞蹈',], 
['绘画','书法、篆刻','雕塑','摄影艺术','工艺美术',], 
['戏剧艺术','电影艺术','电视艺术',], 
['原始社会','奴隶社会','封建社会',], 
['半封建半殖民地社会','中华人民共和国史',], 
['考古学理论与方法','世界考古','中国考古',], 
['哲学理论','世界哲学','中国哲学','思维科学','自然辨证发',], 
['心理学',], 
['综合','佛教','道教','伊斯兰教','基督教','天主教',], 
['马克思、恩格斯、列宁、毛泽东等著作','马克思、恩格斯、列宁、毛泽东等著作','马原、毛概、邓理、列宁主义的学习和研究',], 
['建党理论、党章','党的组织、会议、文献','党的总路线和总政策','党的建设','党的领导','中国共产党与各国共产党的关系','中国共产主义青年团',], 
['思想政治教育与精神文明建设','革命传统教育','形式教育，国情教育','道德教育','国际主义，爱国主义教育',], 
['军事理论与军史','军事组织与管理','战略、战役、战术',], 
['国家法、宪法',], 
['国际法理论','国际经济法','国际私法',], 
['民族法',], 
['幼教理论','思想品德教育','幼儿教学','学校管理','世界各国幼教概况',], 
['教学理论与教学方法','教材、课本、辅助教材、参考书',], 
['研究生教育','各类型高等学校','高等教育理论','教学理论、教学方法','思想政治教育、德育','科学研究工作','教师与学生','中国及地方高等教育','世界各国教育','师范教育',], 
['电子工业','真空电子技术','光电子技术、激光技术','半导体技术','电子元件、组件','基本电子电路','微电子学，集成电路',], 
['电子计算机','微信计算机','其他计算机','一般性问题',], 
['自动化基础理论','自动化技术及设备','射流技术（流控技术）','遥感技术','远动技术',], 
['信息与传播理论','新闻学、新闻事业','广播电视',], 
['图书馆学、图书馆事业','情报学、情报工作',], 
['档案学、档案事业','博物馆学、博物馆事业',], 
['计算机网络理论','网络结构与设计','通信协议','通信设备与线路','网络管理与运行','网络安全','网络应用程序',], 
['农业经济理论','世界农业经济','中国农业经济',], 
['经济概论','社会生产方式','经济学分支科学及各科经济学','经济思想史',], 
['世界经济','中国经济','其他各国经济',], 
['经济统计概述','经济统计方法','专门经济统计','国籍经济统计','经济统计组织与工作',], 
['工业经济理论','世界工业经济','中国工业经济',], 
['铁路运输经济','陆路、公路运输经济','水路运输经济','航空运输经济','城市交通运输经济','交通运输经济理论及概况',], 
['旅游经济理论与方法','旅游事业','旅游资源','旅游文化','旅游与商业','旅游标准、旅游投诉',], 
['信息产业经济','电信','邮政','邮电经济理论','世界各国邮电事业',], 
['服务业经济概论','旅馆业','餐饮业','娱乐业','其他服务业',], 
['货币','金融、银行',], 
['证券学理论','世界证券学','中国证券学','各国证券学',], 
['保险学理论','世界保险业','中国保险业','各国保险业',], 
['领导学','决策学',]
               ];  
    
    var tip=[10,20,26,30,40,50,57,70];
    function getSecond(){  
        //获得省份下拉框的对象  
        var sltFirst=document.form1.first;  
        //获得城市下拉框的对象  
        var sltSecond=document.form1.second;  
         
        //得到对应省份的城市数组  
        var SecondChoice=second[sltFirst.selectedIndex - 1];  
  
        //清空城市下拉框，仅留提示选项  
        sltSecond.length=1;  
  
        //将城市数组中的值填充到城市下拉框中  
        for(var i=0;i<SecondChoice.length;i++){  
         //Option(选项描述，选项值) 等价于 <option value="选项值" >选项描述</option>;  
            sltSecond[i+1]=new Option(SecondChoice[i],SecondChoice[i]); 
           
        }  
    }  
   
    function getThird(){
    	 var index=document.form1.first.selectedIndex;
    	var sltSecond=document.form1.second;
    	var  sltThird=document.form1.third;
		index=tip[index-2];
    	var ThirdChoice=third[sltSecond.selectedIndex - 1+index];
    	sltThird.length=1;
    	for(var j=0;j<ThirdChoice.length;j++){
    		sltThird[j+1]=new Option(ThirdChoice[j],ThirdChoice[j]);
    		
    	}
    	 index=document.form1.first.selectedIndex;
    	
    	 
    }
    